Repository: tyusha0/buku
Catalog: locale/*/LC_MESSAGES/buku.po
Languages: ru

source: buku (? for help):
ru: buku (? вызов справки):

source: Passwords do not match
ru: Пароли не совпадают

source: File encrypted
ru: Файл зашифрован

source: Decryption failed
ru: Расшифровка не удалась

source: %s missing
ru: %s отсутствует

source: File decrypted
ru: Файл расшифрован

source: Tainted file
ru: Повреждённый файл

source: Unlock database first
ru: Сначала разблокируйте базу данных

source: Invalid URL
ru: Некорректный URL

source: URL [%s] already exists at index %d
ru: URL-адрес [%s] уже существует по индексу %d

source: Malformed URL
ru: Неправильный URL

source: No title
ru: Без заголовка

source: Append the tags to ALL bookmarks? (y/n):
ru: Добавить теги ко ВСЕМ закладкам? (y/n):

source: Delete the tag(s) from ALL bookmarks? (y/n):
ru: Удалить тег(и) из ВСЕХ закладок? (y/n):

source: %d record(s) updated
ru: %d запись(ей) обновлена(о)

source: Malformed URL
ru: Неправильный URL

source: Update ALL bookmarks? (y/n):
ru: Обновить ВСЕ закладки? (y/n):

source: No matching index %d
ru: Нет подходящего индекса %d

source: Index %d: Malformed URL
ru: Индекс %d: неверный URL

source: Index %d: HTTP HEAD requested
ru: Индекс %d: запрошен HTTP HEAD

source: Index %d: Без заголовка
ru: Индекс %d удален

source: Index %d: updated
ru: Индекс %d обновлён

source: Invalid search option
ru: Некорректная опция поиска

source: Index %d moved to %d
ru: Индекс %d перемещен на %d

source: Delete these bookmarks? (y/n):
ru: Удалить эти закладки? (y/n):

source: No matching index
ru: Нет подходящего индекса

source: Delete this bookmark? (y/n):
ru: Удалить эту закладку? (y/n):

source: Index %d deleted
ru: Индекс %d удален

source: Delete the search results? (y/n):
ru: Удалить результаты поиска? (y/n):

source: Remove ALL bookmarks? (y/n):
ru: Удалить ВСЕ закладки? (y/n):

source: No bookmarks deleted
ru: Закладки не удалены

source: All bookmarks deleted
ru: Все закладки удалены

source: 0 records
ru: 0 записей

source: similar tags:
ru: похожие теги:

source: Index %d updated
ru: Индекс %d обновлён

source: Invalid index %d
ru: Некорректный индекс %d

source: No bookmarks added yet ...
ru: Закладки еще не добавлены...

source: No records found
ru: Записи не найдены

source: exists. Overwrite? (y/n):
ru: существует. Перезаписать?

source: %s exported
ru: %s экспортирован(о)

source: Generate auto-tag (YYYYMonDD)? (y/n):
ru: Сгенерировать авто-тег (ГГГГМесДД)? (y/n):

source: Import bookmarks from google chrome? (y/n):
ru: Импортировать закладки из google chrome? (y/n):

source: Could not import bookmarks from google-chrome
ru: Не удалось импортировать закладки из google-chrome

source: Import bookmarks from chromium? (y/n):
ru: Импортировать закладки из chromium? (y/n):

source: Could not import bookmarks from chromium
ru: Не удалось импортировать закладки из chromium

source: Import bookmarks from Vivaldi? (y/n):
ru: Импортировать закладки из Vivaldi? (y/n):

source: Could not import bookmarks from Vivaldi
ru: Не удалось импортировать закладки из Vivaldi

source: Import bookmarks from Firefox? (y/n):
ru: Импортировать закладки из Firefox? (y/n):

source: Could not import bookmarks from Firefox.
ru: Не удалось импортировать закладки из Firefox.

source: Import bookmarks from microsoft edge? (y/n):
ru: Импортировать закладки из microsoft edge? (y/n):

source: Could not import bookmarks from microsoft-edge
ru: Не удалось импортировать закладки из microsoft-edge

source: SYMBOLS: > url + comment # tags Version %s Copyright © 2015-2022 %s License: %s Webpage: https://github.com/jarun/buku
ru: СИМВОЛЫ: > url + комментарий # теги Версия %s Авторские права © 2015-2022 %s Лицензия: %s Страница в Интернете: https://github.com/jarun/buku

source: PROMPT KEYS: 1-N browse search result indices and/or ranges O [id|range [...]] open search results/indices in GUI browser toggle try GUI browser if no arguments a open all results in browser s keyword [...] search for records with ANY keyword S keyword [...] search for records with ALL keywords d match substrings ('pen' matches 'opened') r expression run a regex search t [tag, ...] search by tags; show taglist, if no args g taglist id|range [...] [>>|>|<<] [record id|range ...] append, set, remove (all or specific) tags search by taglist id(s) if records are omitted n show next page of search results o id|range [...] browse bookmarks by indices and/or ranges p id|range [...] print bookmarks by indices and/or ranges w [editor|id] edit and add or update a bookmark c id copy url at search result index to clipboard ? show this help q, ^D, double Enter exit buku
ru: PROMPT KEYS: 1-N просмотр индекса(ов) и/или диапазона(ов) результатов поиска O [id|диапазон [...]] открыть результаты поиска/индексы в браузере с графическим интерфейсом toggle try GUI browser if no arguments a открыть все результаты в браузере s ключевое слово [...] искать записи с ЛЮБЫМ ключевым словом S ключевое слово [...] искать записи со ВСЕМИ ключевыми словами d соответствие подстрокам ('pen' соответствует 'opened') r выражение поиск по регулярному выражению t [тег, ...] поиск по тегам; показать список тегов, если нет аргументов g id теглиста|диапазон [...] [>>|>|<<] [id записи|диапазон ...] добавить, выбрать, удалить (все или определенные) теги поиск по идентификатору(ам) списка тегов, если записи опущены n показать следующую страницу результатов поиска o id|диапазон [...] просматривать закладки по индексам и/или диапазонам p id|диапазон [...] печатать закладки по индексам и/или диапазонам w [редактор|id] изменить и добавить или обновить закладку c id скопировать URL-адрес индекса из результатов поиска в буфер обмена ? показать эту справку q, ^D, двойной Enter выход из buku

source: 0 tags
ru: 0 тэгов

source: No more results
ru: Нет больше результатов

source: 0 results
ru: 0 результатов

source: deep search on
ru: глубокий поиск включен

source: deep search off
ru: глубокий поиск выключен

source: Invalid input
ru: Некорректный ввод

source: No matching index %s
ru: Нет подходящего индекса %s

source: URL copied to tmux buffer.
ru: URL-адрес скопирован в буфер tmux.

source: Failed to locate suitable clipboard utility
ru: Не удалось найти подходящую утилиту буфера обмена

source: This is the latest release
ru: Это последний выпуск

source: Latest upstream release is %s
ru: Последний выпуск основной ветки %s

source: Interrupted.
ru: Прервано.

source: Interrupted.
ru: Прервано.

source: # Lines beginning with "#" will be stripped. # Add URL in next line (single line).
ru: # Строки, начинающиеся с "#", будут удалены. #Добавьте URL в следующую строку (одна строка).

source: # Add TITLE in next line (single line). Leave blank to web fetch, "-" for no title.
ru: # Добавьте ЗАГОЛОВОК в следующую строку (одна строка). Оставьте пустым для загрузки из Интернета, "-" без заголовка.

source: # Add comma-separated TAGS in next line (single line).
ru: # Добавить ТЕГИ, разделенные запятыми, в следующей строке (одна строка).

source: # Add COMMENTS in next line(s). Leave blank to web fetch, "-" for no comments.
ru: # Добавьте КОММЕНТАРИИ в следующую строку (строки). Оставьте пустым для загрузки из Интернета, "-" без комментариев.

source: Edit aborted
ru: Редактирование прервано

source: Cannot open editor
ru: Не могу открыть редактор

source: Cannot open tempfile
ru: Не могу открыть временный файл

source: GENERAL OPTIONS
ru: ОБЩИЕ ОПЦИИ

source: -a, --add URL [tag, ...] bookmark URL with comma-separated tags -u, --update [...] update fields of an existing bookmark accepts indices and ranges refresh title and desc if no edit options if no arguments: - update results when used with search - otherwise refresh all titles and desc -w, --write [editor|index] edit and add a new bookmark in editor else, edit bookmark at index in EDITOR edit last bookmark, if index=-1 if no args, edit new bookmark in EDITOR -d, --delete [...] remove bookmarks from DB accepts indices or a single range if no arguments: - delete results when used with search - otherwise delete all bookmarks -h, --help show this information and exit -v, --version show the program version and exit
ru: -a, --add URL [тег, ...] добавить URL закладки с тегами, разделенными запятыми -u, --update [...] update fields of an existing bookmark accepts indices and ranges refresh title and desc if no edit options if no arguments: - update results when used with search - otherwise refresh all titles and desc -w, --write [editor|index] edit and add a new bookmark in editor else, edit bookmark at index in EDITOR edit last bookmark, if index=-1 if no args, edit new bookmark in EDITOR -d, --delete [...] удалить закладки из БД принимает индексы или один диапазон если нет аргументов: - удаляет результаты при использовании с поиском - иначе удалит все закладки -h, --help показать эту информацию и выйти -v, --version показать версию программы и выйти

source: SEARCH OPTIONS
ru: ОПЦИИ ПОИСКА

source: -s, --sany [...] find records with ANY matching keyword this is the default search option -S, --sall [...] find records matching ALL the keywords special keywords - "blank": entries with empty title/tag "immutable": entries with locked title --deep match substrings ('pen' matches 'opens') -r, --sreg expr run a regex search -t, --stag [tag [,|+] ...] [- tag, ...] search bookmarks by tags use ',' to find entries matching ANY tag use '+' to find entries matching ALL tags excludes entries with tags after ' - ' list all tags, if no search keywords -x, --exclude [...] omit records matching specified keywords
ru: -s, --sany [...] найти записи с ЛЮБЫМ совпадающим ключевым словом это опция поиска по умолчанию -S, --sall [...] найти записи, соответствующие ВСЕМ ключевым словам специальные ключевые слова - "blank": записи с пустым заголовком/тегом "immutable": записи с заблокированным заголовком --deep соответствие подстрокам ('pen' соответствует 'opened') -r, --sreg выражение поиск по регулярному выражению -t, --stag [тег [,|+] ...] [- тег, ...] искать закладки по тегам используйте ',' для поиска записей, соответствующих ЛЮБОМУ тегу используйте '+', чтобы найти записи, соответствующие ВСЕМ тегам исключает записи с тегами после ' - ' перечислить все теги, если нет ключевых слов для поиска -x, --exclude [...] пропустить записи, соответствующие указанным ключевым словам

source: ENCRYPTION OPTIONS
ru: ОПЦИИ ШИФРОВАНИЯ

source: -l, --lock [N] encrypt DB in N (default 8) # iterations -k, --unlock [N] decrypt DB in N (default 8) # iterations
ru: -l, --lock [N] зашифровать БД в N (по умолчанию 8) # итераций -k, --unlock [N] расшифровать БД за N (по умолчанию 8) # итераций

source: POWER TOYS
ru: МОЩНЫЕ ИГРУШКИ

source: --ai auto-import bookmarks from web browsers Firefox, Chrome, Chromium, Vivaldi, Edge -e, --export file export bookmarks to Firefox format HTML export XBEL, if file ends with '.xbel' export Markdown, if file ends with '.md' format: [title](url) <!-- TAGS --> export Orgfile, if file ends with '.org' format: *[[url][title]] :tags: export buku DB, if file ends with '.db' combines with search results, if opted -i, --import file import bookmarks from file supports .html .xbel .json .md .org .db -p, --print [...] show record details by indices, ranges print all bookmarks, if no arguments -n shows the last n results (like tail) -f, --format N limit fields in -p or JSON search output N=1: URL; N=2: URL, tag; N=3: title; N=4: URL, title, tag; N=5: title, tag; N0 (10, 20, 30, 40, 50) omits DB index -j, --json [file] JSON formatted output for -p and search. prints to stdout if argument missing. otherwise writes to given file --colors COLORS set output colors in five-letter string --nc disable color output -n, --count N show N results per page (default 10) --np do not show the subprompt, run and exit -o, --open [...] browse bookmarks by indices and ranges open a random bookmark, if no arguments --oa browse all search results immediately --replace old new replace old tag with new tag everywhere delete old tag, if new tag not specified --shorten index|URL fetch shortened url from tny.im service --expand index|URL expand a tny.im shortened url --cached index|URL browse a cached page from Wayback Machine --suggest show similar tags when adding bookmarks --tacit reduce verbosity, skip some confirmations --nostdin do not wait for input (must be first arg) --threads N max network connections in full refresh default N=4, min N=1, max N=10 -V check latest upstream version available -g, --debug show debug information and verbose logs
ru: --ai автоимпорт закладок из веб-браузеров Firefox, Chrome, Chromium, Vivaldi, Edge -e, --export файл экспортировать закладки в формат Firefox HTML экспорт в XBEL, если файл заканчивается '.xbel' экспорт в Markdown, если файл заканчивается на '.md' формат: [заголовок](url) <!-- ТЕГИ --> экспорт в Orgfile, если файл заканчивается на '.org' формат: *[[url][заголовок]] :теги: экспорт в buku DB, если файл заканчивается на '.db' комбинируется с результатами поиска, если выбрано -i, --import файл импортировать закладки из файла поддерживает .html .xbel .json .md .org .db -p, --print [...] показать подробности записи по индексам, диапазонам вывести все закладки, если нет аргументов -n показывает последние n результатов (как tail) -f, --format N ограничить поля в -p или выводе поиска JSON N=1: URL; N=2: URL, tag; N=3: title; N=4: URL, title, tag; N=5: title, tag; N0 (10, 20, 30, 40, 50) опускает индекс БД -j, --json [файл] вывод в формате JSON для -p и поиска. печатает на стандартный вывод, если аргумент отсутствует. в противном случае пишет в данный файл --colors COLORS установить выходные цвета в пятибуквенной строке --nc отключить цветной вывод -n, --count N показывать N результатов на странице (по умолчанию 10) --np не показывать подсказку, запустить и выйти -o, --open [...] просматривать закладки по индексам и диапазонам открыть случайную закладку, если нет аргументов --oa просмотреть все результаты поиска сразу --replace старый новый заменить везде старый тег новым тегом удалить старый тег, если новый тег не указан --shorten индекс|URL получить укороченный URL из сервиса tny.im --expand индекс|URL расширить сокращенный URL tny.im --cached индекс|URL просмотреть кешированную страницу из Wayback Machine --suggest показывать похожие теги при добавлении закладок --tacit уменьшить многословие, пропустить некоторые подтверждения --nostdin не ждать ввода (должен быть первым аргументом) --threads N максимальное количество сетевых соединений при полном обновлении по умолчанию N=4, мин N=1, макс N=10 -V проверьте последнюю доступную версию основной ветки -g, --debug показать отладочную информацию и подробные журналы

source: buku (? for help)
ru: buku (? вызов справки)

source: no keyword
ru: нет ключевого слова

source: no expression
ru: нет выражения

source: No search criteria to exclude results from
ru: Нет критериев поиска, чтобы исключить результаты из

source: Invalid index or range to update
ru: Некорректный индекс или диапазон для обновления

source: Invalid index or range to delete
ru: Некорректный индекс или диапазон для удаления

source: Invalid index or range or combination
ru: Некорректный индекс или диапазон или комбинация

source: Invalid index or range to print
ru: Некорректный индекс или диапазон для печати

source: Invalid index or range to open
ru: Некорректный индекс или диапазон для открытия
